# 仮説

* ユーザーの行動に流れがあるのではないか？
* 商品の情報も用いてさらにユーザーを分類することはできないか？  
人気商品について、買う人買わない人がいそう？

# 評価値　仮説

* クラスターごとに評価値設定の仕方を変えられるのではないか？
    * １か月間cvをしなかったクラスターは将来的にもcvをしないのではないか？→カートから閲覧を予測(相関をみよう)
    * 購入する回数が多いクラスターは、何かしらの購入までの流れを加味できないか？
    * 閲覧したけど買わなかったら低評価？高評価？　１回閲覧して複数回してなかったら低評価？
* 人気商品に敏感なクラスターがあるのでは？


* 評価値を出した後、そのユーザーの最大評価値ですべての評価値を割り算して、相対的な評価値にした方がよい？

# 推薦　仮説

* 直前に見ていたもの＋それらに類似する商品を推薦する
* 一度買ったものはもう買わないとする処理がいる←oginoさんが実装済み？
* 一度閲覧したものは推薦しない
* 類似したユーザーの評価値が高いものを推薦する

In [1]:
import pandas as pd
from matplotlib import pyplot as plt
from IPython.core.display import display
import seaborn as sns
%matplotlib inline

In [2]:
user_df = pd.read_csv("../..data/train/clustered_user_with_cv_D.csv")
product_df = pd.read_csv("../../data/train/clustered_product_without_cv_D.csv")

In [2]:
df = pd.read_csv("../../data/train/train_D.tsv", sep="\t")
df["time_stamp"] = pd.to_datetime(df["time_stamp"])
user_ids = df["user_id"].unique()
product_ids = df["product_id"].unique()

In [4]:
p_product_df = product_df[(product_df["cluster"] == 2) | (product_df["cluster"] == 3)]
np_product_df = product_df[(product_df["cluster"] == 0) | (product_df["cluster"] == 1)]
p_product_ids = p_product_df["product_id"].unique()
np_product_ids = np_product_df["product_id"].unique()

In [5]:
buyer_ids = df[df["event_type"]==3]["user_id"].unique()

In [6]:
display(user_df.head(3))
display(product_df.head(3))

     user_id    ca    pd   cv  cluster
0  0000000_D  23.0   5.0  0.0        5
1  0000001_D  32.0  18.0  0.0        8
2  0000002_D   4.0   6.0  0.0        4

   product_id   ca   pd   cv  cluster
0  00000000_d  6.0  3.0  0.0        0
1  00000001_d  1.0  3.0  0.0        0
2  00000002_d  0.0  2.0  0.0        0

# 商品

# ユーザー

In [8]:
cluster_len = len(user_df.cluster.unique())

In [70]:
user_df.groupby("cluster").size()

cluster
0         5
1        23
2        28
3       407
4     48230
5     34592
6         2
7       358
8     20225
9       306
10     4431
dtype: int64

* 0  
cartが多(mean:10538)・pdが少(mean:19.4)・cvは0  
* 1  
cart(mean:70)・pd(mean:15)・**cvを全員持つ(mean:9.5)**  
* 2  
cartが多(mean:3192)・pdが少(mean:23)・cvは0
* 3  
cart(mean:132)・pd(mean:77)・cvは0・閲覧を全員50以上する  
* 4  
cartも少(mean:12)・pdも少(mean:9)・cvは0  
* 5  
cartも少(mean:25)・pdも少(mean:3)・cvは0  
* 6  
cartが少(2,192)・pdが多(1530,1144)・**cvもあったりなかったり(0,17)**
* 7  
cart(mean:23)・pd(mean:13)・**cvを全員持つ(mean:1.5)**  
* 8  
cart(mean:21)・pd(mean:16)・cvは0  
* 9  
cartが多(mean:615)・pdが少(mean:14)・cvは0  
* 10  
cart(mean:50)・pd(mean:33)・cvは0・閲覧を全員20以上する

## 評価値 仮説
* Cluster0
    * カートに入れることしかしていないユーザー
        - カート回数が多いほど評価を（上げる・）下げる（微小量ずつ）←商品のカート数と閲覧数に相関ほとんどなし（マイナス）
    * 閲覧もしているユーザー
        * カートに入れ、かつ閲覧をしているもの・・・評価値をあげる
        * カートに入れるだけ・・・評価値を（上げる・）下げる（微小量だけ）
        * 閲覧だけ・・・評価値を大きく上げる
* Cluster2,9
    * カートに入れることしかしていないユーザー
        - カート回数が多いほど評価を上げる（・下げる）（微小量ずつ）←商品のカート数と閲覧数に相関ほとんどなし
    * 閲覧もしているユーザー
        * カートに入れ、かつ閲覧をしているもの・・・評価値を大きくあげる
        * カートに入れるだけ・・・評価値を上げる（・下げる）（微小量だけ）
        * 閲覧だけ・・・評価値を上げる
-----
* Cluster4  
    * カートと閲覧の回数が多いほど評価を上げる(カートに関しては微小量)←商品のカート数と閲覧数に相関ほとんどなし
* Cluster5,8
    * カートと閲覧の回数が多いほど評価を上げる(カートに関してはCluster4よりは大きく)←商品のカート数と閲覧数に相関あり
-----
* Cluster1,7  
    * 買った商品・・・評価値上げる（ただし、推薦はしない）
    * 買う前（2,3日前）に見てたけど買わなかった商品・・・評価値下げる 
    * カートと閲覧の回数が多いほど評価を上げる(カートに関しては微小量)
-----
* Cluster3  
    * カート回数が多いほど評価を下げる(微小量) 
* Cluster10  
    * カートの回数が多いほど評価を下げる(Cluster3よりは大きく)
* 共通
    * 閲覧した商品・・・評価値上げる（ただし、推薦はしない）
    * 閲覧前（2,3日前）にカートにいれてたけど買わなかった商品・・・評価値下げる （仮）
    
-----
* Cluster6 
    * 購入経験のあるユーザー（0016920_D）
    * 購入経験のないユーザー（0102238_D）

商品に関してはcaが多いほどpdも多い

In [18]:
def describe_cluster(i, df):
    print("cluster_" + str(i))
    display_df = pd.DataFrame()
    display_target_df = df[df["cluster"] == i][["ca","pd","cv"]]
    if display_df.empty:
        display_df = display_target_df.describe().T
    else:
        display_df = pd.concat([display_df, display_target_df.describe().T])
    display(display_df)
    print()

# for i in range(0,11):
#     describe_cluster(i, user_df)

In [7]:
user_count_dfs = []
for i in range(cluster_len):
    user_cluster_df = user_df[user_df["cluster"] == i]
    user_count_dfs.append(user_cluster_df)

In [15]:
df_added_cluster = pd.merge(df, user_df[["user_id", "cluster"]], on='user_id')

In [19]:
df_added_cluster[df_added_cluster["cluster"]==0]

array(['0041349_D', '0042222_D', '0014163_D', '0043330_D', '0100726_D'], dtype=object)

In [21]:
for i in range(cluster_len):
    df_added_cluster[df_added_cluster["cluster"]==i].to_csv("../../data/train/D_cluster_" + str(i) + ".csv",index=False)

In [4]:
def make_count_df_p(df):
    dfs = []
    labels = ["ca", "pd", "cl", "cv"]
    for i, label in enumerate(labels):
        dic = {"id":i, "label":label, "df":df[df["event_type"] == i]}
        dfs.append(dic)
    c_dfs= []
    for df_item in dfs:
        new_df = pd.DataFrame(df_item["df"].groupby("product_id").size(), columns=[df_item["label"]])
        dic = {"id":df_item["id"], "label":df_item["label"], "df":new_df}
        c_dfs.append(dic)
    count_df = pd.concat([c_dfs[0]["df"],c_dfs[1]["df"],c_dfs[3]["df"]], axis=1).fillna(0)
    return count_df

In [5]:
def make_count_df_u(df):
    dfs = []
    labels = ["ca", "pd", "cl", "cv"]
    for i, label in enumerate(labels):
        dic = {"id":i, "label":label, "df":df[df["event_type"] == i]}
        dfs.append(dic)
    c_dfs= []
    for df_item in dfs:
        new_df = pd.DataFrame(df_item["df"].groupby("user_id").size(), columns=[df_item["label"]])
        dic = {"id":df_item["id"], "label":df_item["label"], "df":new_df}
        c_dfs.append(dic)
    count_df = pd.concat([c_dfs[0]["df"],c_dfs[1]["df"],c_dfs[3]["df"]], axis=1).fillna(0)
    return count_df

In [12]:
def get_user_ids(cluster, user_df):
    user_ids = list(user_df[user_df["cluster"] == cluster].user_id)
    return user_ids

In [7]:
def get_action_df(cluster_df):
    action_df = cluster_df.drop_duplicates(["user_id","product_id","event_type"]).sort_values(by=["time_stamp"])
    return action_df

In [9]:
# cluster_user_ids = []
# for i in range(cluster_len):
#     user_ids = get_user_ids(i, user_df)
#     cluster_user_ids.append(user_ids)

In [85]:
def prepare_cluster_analysis(cluster, user_df):
    filename = "../../data/train/D_cluster_{}.csv".format(cluster)
    cluster_df = pd.read_csv(filename)
    action_df = get_action_df(cluster_df)
    user_ids = get_user_ids(cluster, user_df)
    return cluster_df, action_df, user_ids

def count_analysis(cluster_df):
    count_df_p = make_count_df_p(cluster_df)
    count_df_u = make_count_df_u(cluster_df)
    print("product")
    display(count_df_p.corr())
    print("user")
    display(count_df_u.corr())

### Cluster 0
cartが多(mean:10538)・pdが少(mean:19.4)・cvは0

* 0014163_D, 0041349_D, 0042222_D  
【評価値】
カートに入れ、かつ閲覧をしているもの→高く  
カートに入れただけ→前者よりは低く  
閲覧しただけ→前者よりは低く  

最終カート入れ・閲覧時が前すぎたら推薦しない（評価値は下げずに←興味はあっても買わなかっただけかも←閲覧くらいしてくれるかも）

* 0043330_D,0100726_D  
閲覧履歴がないため、おそらく閲覧はしないものと思われるため、後回し。

In [106]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(0, user_df)
user_ids

['0014163_D', '0041349_D', '0042222_D', '0043330_D', '0100726_D']

In [41]:
user_df[user_df["cluster"] == 0]

          user_id       ca    pd   cv  cluster
14163   0014163_D   7887.0   9.0  0.0        0
41349   0041349_D   8944.0  34.0  0.0        0
42222   0042222_D   8934.0  54.0  0.0        0
43330   0043330_D  12165.0   0.0  0.0        0
100726  0100726_D  14761.0   0.0  0.0        0

In [109]:
action_df[(action_df["user_id"]=="0014163_D")&(action_df["time_stamp"]>="2017-04-25")].sort_values(["time_stamp","user_id","product_id"])

         user_id  product_id  event_type  ad               time_stamp  cluster
25696  0014163_D  00406357_d           0  -1  2017-04-25 03:46:05.085        0
25693  0014163_D  00561560_d           0  -1  2017-04-25 08:42:40.010        0
25697  0014163_D  00555258_d           0  -1  2017-04-25 08:51:26.534        0
25669  0014163_D  00297783_d           0  -1  2017-04-25 08:52:00.326        0
18655  0014163_D  00398893_d           0  -1  2017-04-25 10:06:02.895        0
18175  0014163_D  00683199_d           0  -1  2017-04-25 11:17:45.841        0
25710  0014163_D  00195072_d           0  -1  2017-04-25 11:55:11.108        0
25656  0014163_D  00711572_d           0  -1  2017-04-25 12:41:44.109        0
25677  0014163_D  00576826_d           0  -1  2017-04-25 13:50:33.420        0
25725  0014163_D  00181525_d           0  -1  2017-04-25 16:39:25.590        0
25721  0014163_D  00504676_d           0  -1  2017-04-25 18:35:14.119        0
25743  0014163_D  00782733_d           0  -1  2017-04-26 05:18:04.099        0
25719  0014163_D  00031942_d           0  -1  2017-04-26 06:03:46.107        0
18355  0014163_D  00743174_d           0  -1  2017-04-26 06:28:53.236        0
25753  0014163_D  00404686_d           0  -1  2017-04-26 08:26:24.216        0
25733  0014163_D  00771072_d           0  -1  2017-04-26 08:26:24.216        0
25744  0014163_D  00186632_d           0  -1  2017-04-26 10:51:27.417        0
25720  0014163_D  00145954_d           0  -1  2017-04-26 12:51:57.493        0
17966  0014163_D  00368471_d           1  -1  2017-04-26 16:11:47.873        0
18034  0014163_D  00748105_d           0  -1  2017-04-26 23:25:35.130        0
25794  0014163_D  00624748_d           0  -1  2017-04-27 01:58:58.934        0
25821  0014163_D  00669539_d           0  -1  2017-04-27 04:17:46.150        0
25810  0014163_D  00327299_d           0  -1  2017-04-27 04:55:26.002        0
25766  0014163_D  00330041_d           0  -1  2017-04-27 06:04:16.007        0
25822  0014163_D  00003348_d           0  -1  2017-04-27 06:28:24.302        0
25812  0014163_D  00310910_d           0  -1  2017-04-27 09:32:05.150        0
25784  0014163_D  00481998_d           0  -1  2017-04-27 09:32:05.150        0
25772  0014163_D  00239414_d           0  -1  2017-04-27 10:40:28.968        0
25814  0014163_D  00547854_d           0  -1  2017-04-27 13:11:12.707        0
25829  0014163_D  00557316_d           0  -1  2017-04-27 13:11:12.707        0
25800  0014163_D  00639612_d           0  -1  2017-04-27 14:10:53.902        0
18361  0014163_D  00493546_d           0  -1  2017-04-27 14:12:29.297        0
25827  0014163_D  00614514_d           0  -1  2017-04-27 14:38:47.423        0
25837  0014163_D  00782234_d           0  -1  2017-04-27 15:44:30.554        0
25850  0014163_D  00367116_d           0  -1  2017-04-28 09:23:20.963        0
25831  0014163_D  00287174_d           0  -1  2017-04-28 12:04:49.439        0
25843  0014163_D  00035185_d           0  -1  2017-04-28 14:30:09.843        0
18343  0014163_D  00150215_d           0  -1  2017-04-29 11:32:34.719        0
25860  0014163_D  00772508_d           0  -1  2017-04-29 17:44:07.594        0
25861  0014163_D  00715011_d           0  -1  2017-04-30 03:41:08.549        0
18591  0014163_D  00533692_d           0  -1  2017-04-30 06:12:20.442        0
25859  0014163_D  00388203_d           0  -1  2017-04-30 06:14:47.735        0
25857  0014163_D  00438654_d           0  -1  2017-04-30 06:36:43.931        0
25852  0014163_D  00637825_d           0  -1  2017-04-30 07:42:32.023        0
25854  0014163_D  00170414_d           0  -1  2017-04-30 07:43:34.822        0
25856  0014163_D  00439548_d           0  -1  2017-04-30 07:43:34.822        0

In [69]:
for user_id in user_ids:
    print(user_id)
    for p_id in list(action_df[(action_df["user_id"]==user_id) & (action_df["event_type"]==1)].product_id):
        display(cluster_df[(cluster_df.event_type == 1) & (cluster_df["user_id"]==user_id) & (cluster_df["product_id"]==p_id)])

0014163_D

         user_id  product_id  event_type  ad               time_stamp  cluster
19045  0014163_D  00201404_d           1  -1  2017-04-02 15:00:27.120        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18943  0014163_D  00225045_d           1  -1  2017-04-05 17:28:26.426        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18626  0014163_D  00220513_d           1  -1  2017-04-06 16:16:34.523        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18070  0014163_D  00338331_d           1  -1  2017-04-13 15:10:33.529        0

         user_id  product_id  event_type  ad               time_stamp  cluster
19046  0014163_D  00077127_d           1  -1  2017-04-15 15:47:03.143        0

         user_id  product_id  event_type  ad               time_stamp  cluster
19047  0014163_D  00197437_d           1  -1  2017-04-17 15:12:28.304        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18593  0014163_D  00648652_d           1  -1  2017-04-17 15:19:23.609        0

         user_id  product_id  event_type  ad               time_stamp  cluster
19048  0014163_D  00368024_d           1  -1  2017-04-18 06:36:51.645        0

         user_id  product_id  event_type  ad               time_stamp  cluster
17966  0014163_D  00368471_d           1  -1  2017-04-26 16:11:47.873        0

0041349_D

       user_id  product_id  event_type  ad               time_stamp  cluster
179  0041349_D  00370088_d           1  -1  2017-04-04 15:42:15.521        0

       user_id  product_id  event_type  ad               time_stamp  cluster
876  0041349_D  00724299_d           1  -1  2017-04-04 17:19:07.834        0

       user_id  product_id  event_type  ad               time_stamp  cluster
231  0041349_D  00674053_d           1  -1  2017-04-10 23:33:03.870        0

       user_id  product_id  event_type  ad               time_stamp  cluster
701  0041349_D  00033948_d           1  -1  2017-04-13 03:12:10.306        0

        user_id  product_id  event_type  ad               time_stamp  cluster
1314  0041349_D  00317758_d           1  -1  2017-04-13 19:20:52.798        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4324  0041349_D  00009005_d           1  -1  2017-04-15 03:53:15.686        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4323  0041349_D  00265048_d           1  -1  2017-04-15 03:53:50.994        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6041  0041349_D  00580693_d           1  -1  2017-04-17 10:52:54.922        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6047  0041349_D  00185012_d           1  -1  2017-04-17 10:56:42.011        0

        user_id  product_id  event_type  ad               time_stamp  cluster
1186  0041349_D  00300793_d           1  -1  2017-04-17 11:04:41.508        0

       user_id  product_id  event_type  ad               time_stamp  cluster
689  0041349_D  00158305_d           1  -1  2017-04-19 08:38:16.219        0
690  0041349_D  00158305_d           1  -1  2017-04-19 08:38:06.230        0

        user_id  product_id  event_type  ad               time_stamp  cluster
1461  0041349_D  00390115_d           1  -1  2017-04-21 15:25:44.926        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6056  0041349_D  00247973_d           1  -1  2017-04-23 19:53:57.537        0

       user_id  product_id  event_type  ad               time_stamp  cluster
230  0041349_D  00324955_d           1  -1  2017-04-25 09:52:09.361        0

       user_id  product_id  event_type  ad               time_stamp  cluster
645  0041349_D  00580528_d           1  -1  2017-04-25 09:55:28.068        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4395  0041349_D  00669405_d           1  -1  2017-04-25 14:43:14.023        0

       user_id  product_id  event_type  ad               time_stamp  cluster
873  0041349_D  00190502_d           1  -1  2017-04-25 15:09:45.326        0

       user_id  product_id  event_type  ad               time_stamp  cluster
542  0041349_D  00628380_d           1  -1  2017-04-25 15:22:30.704        0

       user_id  product_id  event_type  ad               time_stamp  cluster
330  0041349_D  00292639_d           1  -1  2017-04-25 15:36:35.831        0

        user_id  product_id  event_type  ad               time_stamp  cluster
3114  0041349_D  00618008_d           1  -1  2017-04-25 17:19:33.053        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4178  0041349_D  00628236_d           1  -1  2017-04-25 17:21:24.106        0

        user_id  product_id  event_type  ad               time_stamp  cluster
3104  0041349_D  00164948_d           1  -1  2017-04-25 17:38:41.648        0

       user_id  product_id  event_type  ad               time_stamp  cluster
785  0041349_D  00628434_d           1  -1  2017-04-25 19:58:37.899        0

       user_id  product_id  event_type  ad               time_stamp  cluster
392  0041349_D  00439421_d           1  -1  2017-04-25 21:26:40.001        0
393  0041349_D  00439421_d           1  -1  2017-04-25 21:27:13.029        0

        user_id  product_id  event_type  ad               time_stamp  cluster
2137  0041349_D  00292135_d           1  -1  2017-04-25 21:30:16.180        0
2138  0041349_D  00292135_d           1  -1  2017-04-25 21:39:00.731        0

        user_id  product_id  event_type  ad               time_stamp  cluster
2443  0041349_D  00292669_d           1  -1  2017-04-25 23:13:12.426        0

       user_id  product_id  event_type  ad               time_stamp  cluster
445  0041349_D  00591788_d           1  -1  2017-04-26 21:56:38.123        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6040  0041349_D  00301267_d           1  -1  2017-04-27 14:19:38.607        0

        user_id  product_id  event_type  ad               time_stamp  cluster
2123  0041349_D  00522270_d           1  -1  2017-04-27 15:04:49.295        0

       user_id  product_id  event_type  ad               time_stamp  cluster
292  0041349_D  00200353_d           1  -1  2017-04-28 02:40:50.660        0

       user_id  product_id  event_type  ad               time_stamp  cluster
163  0041349_D  00692285_d           1  -1  2017-04-28 10:33:32.943        0

0042222_D

         user_id  product_id  event_type  ad               time_stamp  cluster
11267  0042222_D  00616599_d           1  -1  2017-04-04 15:15:01.177        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11266  0042222_D  00717431_d           1  -1  2017-04-04 15:19:48.419        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9717  0042222_D  00226750_d           1  -1  2017-04-07 20:15:46.795        0
9718  0042222_D  00226750_d           1  -1  2017-04-08 01:32:48.982        0
9719  0042222_D  00226750_d           1  -1  2017-04-08 05:38:51.206        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9377  0042222_D  00582204_d           1  -1  2017-04-09 18:30:33.491        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9622  0042222_D  00096417_d           1  -1  2017-04-10 03:05:11.363        0

         user_id  product_id  event_type  ad               time_stamp  cluster
12483  0042222_D  00427654_d           1  -1  2017-04-12 23:20:03.260        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9315  0042222_D  00200943_d           1  -1  2017-04-13 03:54:29.060        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11247  0042222_D  00477148_d           1  -1  2017-04-17 15:10:27.991        0

         user_id  product_id  event_type  ad               time_stamp  cluster
12081  0042222_D  00249811_d           1  -1  2017-04-17 15:48:18.258        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9195  0042222_D  00307512_d           1  -1  2017-04-17 16:24:36.348        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9556  0042222_D  00673177_d           1  -1  2017-04-17 16:38:42.443        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10970  0042222_D  00703752_d           1  -1  2017-04-17 16:52:20.705        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11242  0042222_D  00292248_d           1  -1  2017-04-17 17:27:09.630        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9551  0042222_D  00429757_d           1  -1  2017-04-17 18:14:34.997        0
9552  0042222_D  00429757_d           1  -1  2017-04-17 16:03:43.483        0

         user_id  product_id  event_type  ad               time_stamp  cluster
15330  0042222_D  00404562_d           1  -1  2017-04-17 20:33:36.231        0
15331  0042222_D  00404562_d           1  -1  2017-04-17 20:32:29.548        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10971  0042222_D  00096030_d           1  -1  2017-04-19 03:16:24.300        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10324  0042222_D  00231263_d           1  -1  2017-04-19 03:17:34.844        0
10325  0042222_D  00231263_d           1  -1  2017-04-19 03:25:39.262        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9519  0042222_D  00203362_d           1  -1  2017-04-19 03:17:54.523        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9810  0042222_D  00011063_d           1  -1  2017-04-19 03:28:39.944        0
9811  0042222_D  00011063_d           1  -1  2017-04-19 03:27:42.798        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9553  0042222_D  00158305_d           1  -1  2017-04-19 08:50:51.990        0
9554  0042222_D  00158305_d           1  -1  2017-04-19 08:50:46.985        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9240  0042222_D  00351800_d           1  -1  2017-04-21 15:18:11.790        0
9241  0042222_D  00351800_d           1  -1  2017-04-21 15:15:54.362        0
9242  0042222_D  00351800_d           1  -1  2017-04-21 15:39:26.636        0
9243  0042222_D  00351800_d           1  -1  2017-04-21 15:31:26.678        0
9244  0042222_D  00351800_d           1  -1  2017-04-21 15:10:26.022        0
9245  0042222_D  00351800_d           1  -1  2017-04-21 15:10:18.276        0
9246  0042222_D  00351800_d           1  -1  2017-04-21 15:10:31.015        0
9247  0042222_D  00351800_d           1  -1  2017-04-21 15:18:13.246        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9234  0042222_D  00346389_d           1  -1  2017-04-21 15:24:36.531        0
9235  0042222_D  00346389_d           1  -1  2017-04-21 15:32:46.360        0
9236  0042222_D  00346389_d           1  -1  2017-04-21 15:31:56.321        0
9237  0042222_D  00346389_d           1  -1  2017-04-21 15:27:58.463        0
9238  0042222_D  00346389_d           1  -1  2017-04-21 15:24:40.703        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9378  0042222_D  00591788_d           1  -1  2017-04-23 01:36:01.048        0
9379  0042222_D  00591788_d           1  -1  2017-04-28 10:40:56.530        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9520  0042222_D  00136816_d           1  -1  2017-04-23 09:04:29.449        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9808  0042222_D  00564074_d           1  -1  2017-04-23 09:31:32.117        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10171  0042222_D  00017223_d           1  -1  2017-04-25 17:32:24.352        0
10172  0042222_D  00017223_d           1  -1  2017-04-25 19:12:30.301        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11272  0042222_D  00292669_d           1  -1  2017-04-25 18:17:22.639        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9650  0042222_D  00628434_d           1  -1  2017-04-25 19:08:55.250        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10957  0042222_D  00292135_d           1  -1  2017-04-25 19:45:47.642        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9636  0042222_D  00701561_d           1  -1  2017-04-27 10:11:37.363        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10947  0042222_D  00237978_d           1  -1  2017-04-27 10:18:03.198        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9199  0042222_D  00542183_d           1  -1  2017-04-27 14:11:45.125        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9140  0042222_D  00200638_d           1  -1  2017-04-27 16:48:26.905        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9251  0042222_D  00200353_d           1  -1  2017-04-27 22:38:04.664        0

0043330_D
0100726_D

In [71]:
for user_id in user_ids:
    print(user_id)
    for p_id in list(action_df[(action_df["user_id"]==user_id) & (action_df["event_type"]==1)].product_id):
        display(action_df[(action_df["user_id"]==user_id) & (action_df["product_id"]==p_id)])

0014163_D

         user_id  product_id  event_type  ad               time_stamp  cluster
19045  0014163_D  00201404_d           1  -1  2017-04-02 15:00:27.120        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18943  0014163_D  00225045_d           1  -1  2017-04-05 17:28:26.426        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18626  0014163_D  00220513_d           1  -1  2017-04-06 16:16:34.523        0
18627  0014163_D  00220513_d           0  -1  2017-04-06 23:26:52.043        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18070  0014163_D  00338331_d           1  -1  2017-04-13 15:10:33.529        0

         user_id  product_id  event_type  ad               time_stamp  cluster
19046  0014163_D  00077127_d           1  -1  2017-04-15 15:47:03.143        0

         user_id  product_id  event_type  ad               time_stamp  cluster
19047  0014163_D  00197437_d           1  -1  2017-04-17 15:12:28.304        0

         user_id  product_id  event_type  ad               time_stamp  cluster
18593  0014163_D  00648652_d           1  -1  2017-04-17 15:19:23.609        0

         user_id  product_id  event_type  ad               time_stamp  cluster
19048  0014163_D  00368024_d           1  -1  2017-04-18 06:36:51.645        0

         user_id  product_id  event_type  ad               time_stamp  cluster
17966  0014163_D  00368471_d           1  -1  2017-04-26 16:11:47.873        0

0041349_D

       user_id  product_id  event_type  ad               time_stamp  cluster
180  0041349_D  00370088_d           0  -1  2017-04-04 13:28:25.133        0
179  0041349_D  00370088_d           1  -1  2017-04-04 15:42:15.521        0

       user_id  product_id  event_type  ad               time_stamp  cluster
876  0041349_D  00724299_d           1  -1  2017-04-04 17:19:07.834        0
877  0041349_D  00724299_d           0  -1  2017-04-04 23:47:23.142        0

       user_id  product_id  event_type  ad               time_stamp  cluster
231  0041349_D  00674053_d           1  -1  2017-04-10 23:33:03.870        0

       user_id  product_id  event_type  ad               time_stamp  cluster
701  0041349_D  00033948_d           1  -1  2017-04-13 03:12:10.306        0

        user_id  product_id  event_type  ad               time_stamp  cluster
1314  0041349_D  00317758_d           1  -1  2017-04-13 19:20:52.798        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4324  0041349_D  00009005_d           1  -1  2017-04-15 03:53:15.686        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4323  0041349_D  00265048_d           1  -1  2017-04-15 03:53:50.994        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6041  0041349_D  00580693_d           1  -1  2017-04-17 10:52:54.922        0
6042  0041349_D  00580693_d           0  -1  2017-04-17 10:55:39.721        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6047  0041349_D  00185012_d           1  -1  2017-04-17 10:56:42.011        0
6048  0041349_D  00185012_d           0  -1  2017-04-17 10:57:25.529        0

        user_id  product_id  event_type  ad               time_stamp  cluster
1186  0041349_D  00300793_d           1  -1  2017-04-17 11:04:41.508        0
1187  0041349_D  00300793_d           0  -1  2017-04-17 11:09:42.057        0

       user_id  product_id  event_type  ad               time_stamp  cluster
691  0041349_D  00158305_d           0  -1  2017-04-17 11:40:32.029        0
689  0041349_D  00158305_d           1  -1  2017-04-19 08:38:16.219        0

        user_id  product_id  event_type  ad               time_stamp  cluster
1461  0041349_D  00390115_d           1  -1  2017-04-21 15:25:44.926        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6056  0041349_D  00247973_d           1  -1  2017-04-23 19:53:57.537        0

       user_id  product_id  event_type  ad               time_stamp  cluster
230  0041349_D  00324955_d           1  -1  2017-04-25 09:52:09.361        0

       user_id  product_id  event_type  ad               time_stamp  cluster
645  0041349_D  00580528_d           1  -1  2017-04-25 09:55:28.068        0
646  0041349_D  00580528_d           0  -1  2017-04-25 14:44:01.679        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4395  0041349_D  00669405_d           1  -1  2017-04-25 14:43:14.023        0
4396  0041349_D  00669405_d           0  -1  2017-04-25 14:55:05.173        0

       user_id  product_id  event_type  ad               time_stamp  cluster
873  0041349_D  00190502_d           1  -1  2017-04-25 15:09:45.326        0
874  0041349_D  00190502_d           0  -1  2017-04-25 16:20:58.509        0

       user_id  product_id  event_type  ad               time_stamp  cluster
542  0041349_D  00628380_d           1  -1  2017-04-25 15:22:30.704        0
543  0041349_D  00628380_d           0  -1  2017-04-25 15:22:32.837        0

       user_id  product_id  event_type  ad               time_stamp  cluster
330  0041349_D  00292639_d           1  -1  2017-04-25 15:36:35.831        0

        user_id  product_id  event_type  ad               time_stamp  cluster
3114  0041349_D  00618008_d           1  -1  2017-04-25 17:19:33.053        0

        user_id  product_id  event_type  ad               time_stamp  cluster
4179  0041349_D  00628236_d           0  -1  2017-04-25 14:59:48.233        0
4178  0041349_D  00628236_d           1  -1  2017-04-25 17:21:24.106        0

        user_id  product_id  event_type  ad               time_stamp  cluster
3105  0041349_D  00164948_d           0  -1  2017-04-25 14:57:48.875        0
3104  0041349_D  00164948_d           1  -1  2017-04-25 17:38:41.648        0

       user_id  product_id  event_type  ad               time_stamp  cluster
785  0041349_D  00628434_d           1  -1  2017-04-25 19:58:37.899        0
786  0041349_D  00628434_d           0  -1  2017-04-25 20:43:45.317        0

       user_id  product_id  event_type  ad               time_stamp  cluster
394  0041349_D  00439421_d           0  -1  2017-04-25 15:01:46.079        0
392  0041349_D  00439421_d           1  -1  2017-04-25 21:26:40.001        0

        user_id  product_id  event_type  ad               time_stamp  cluster
2139  0041349_D  00292135_d           0  -1  2017-04-17 10:50:52.577        0
2137  0041349_D  00292135_d           1  -1  2017-04-25 21:30:16.180        0

        user_id  product_id  event_type  ad               time_stamp  cluster
2444  0041349_D  00292669_d           0  -1  2017-04-25 19:56:58.612        0
2443  0041349_D  00292669_d           1  -1  2017-04-25 23:13:12.426        0

       user_id  product_id  event_type  ad               time_stamp  cluster
446  0041349_D  00591788_d           0  -1  2017-04-14 07:32:02.608        0
445  0041349_D  00591788_d           1  -1  2017-04-26 21:56:38.123        0

        user_id  product_id  event_type  ad               time_stamp  cluster
6040  0041349_D  00301267_d           1  -1  2017-04-27 14:19:38.607        0

        user_id  product_id  event_type  ad               time_stamp  cluster
2123  0041349_D  00522270_d           1  -1  2017-04-27 15:04:49.295        0
2124  0041349_D  00522270_d           0  -1  2017-04-27 15:05:30.031        0

       user_id  product_id  event_type  ad               time_stamp  cluster
293  0041349_D  00200353_d           0  -1  2017-04-27 13:52:41.200        0
292  0041349_D  00200353_d           1  -1  2017-04-28 02:40:50.660        0

       user_id  product_id  event_type  ad               time_stamp  cluster
164  0041349_D  00692285_d           0  -1  2017-04-27 19:16:24.732        0
163  0041349_D  00692285_d           1  -1  2017-04-28 10:33:32.943        0

0042222_D

         user_id  product_id  event_type  ad               time_stamp  cluster
11267  0042222_D  00616599_d           1  -1  2017-04-04 15:15:01.177        0
11268  0042222_D  00616599_d           0  -1  2017-04-04 15:33:45.211        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11266  0042222_D  00717431_d           1  -1  2017-04-04 15:19:48.419        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9717  0042222_D  00226750_d           1  -1  2017-04-07 20:15:46.795        0
9720  0042222_D  00226750_d           0  -1  2017-04-08 13:26:19.277        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9377  0042222_D  00582204_d           1  -1  2017-04-09 18:30:33.491        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9623  0042222_D  00096417_d           0  -1  2017-04-08 10:01:01.175        0
9622  0042222_D  00096417_d           1  -1  2017-04-10 03:05:11.363        0

         user_id  product_id  event_type  ad               time_stamp  cluster
12483  0042222_D  00427654_d           1  -1  2017-04-12 23:20:03.260        0
12484  0042222_D  00427654_d           0  -1  2017-04-13 04:02:18.062        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9315  0042222_D  00200943_d           1  -1  2017-04-13 03:54:29.060        0
9316  0042222_D  00200943_d           0  -1  2017-04-27 17:58:34.085        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11247  0042222_D  00477148_d           1  -1  2017-04-17 15:10:27.991        0

         user_id  product_id  event_type  ad               time_stamp  cluster
12081  0042222_D  00249811_d           1  -1  2017-04-17 15:48:18.258        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9196  0042222_D  00307512_d           0  -1  2017-04-17 15:38:51.450        0
9195  0042222_D  00307512_d           1  -1  2017-04-17 16:24:36.348        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9556  0042222_D  00673177_d           1  -1  2017-04-17 16:38:42.443        0
9557  0042222_D  00673177_d           0  -1  2017-04-17 16:51:37.515        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10970  0042222_D  00703752_d           1  -1  2017-04-17 16:52:20.705        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11243  0042222_D  00292248_d           0  -1  2017-04-17 17:19:14.459        0
11242  0042222_D  00292248_d           1  -1  2017-04-17 17:27:09.630        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9551  0042222_D  00429757_d           1  -1  2017-04-17 18:14:34.997        0

         user_id  product_id  event_type  ad               time_stamp  cluster
15332  0042222_D  00404562_d           0  -1  2017-04-17 16:51:02.698        0
15330  0042222_D  00404562_d           1  -1  2017-04-17 20:33:36.231        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10971  0042222_D  00096030_d           1  -1  2017-04-19 03:16:24.300        0
10972  0042222_D  00096030_d           0  -1  2017-04-19 04:27:05.445        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10324  0042222_D  00231263_d           1  -1  2017-04-19 03:17:34.844        0
10326  0042222_D  00231263_d           0  -1  2017-04-19 04:25:47.642        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9519  0042222_D  00203362_d           1  -1  2017-04-19 03:17:54.523        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9810  0042222_D  00011063_d           1  -1  2017-04-19 03:28:39.944        0
9812  0042222_D  00011063_d           0  -1  2017-04-19 04:26:02.388        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9553  0042222_D  00158305_d           1  -1  2017-04-19 08:50:51.990        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9248  0042222_D  00351800_d           0  -1  2017-04-21 15:04:10.820        0
9240  0042222_D  00351800_d           1  -1  2017-04-21 15:18:11.790        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9234  0042222_D  00346389_d           1  -1  2017-04-21 15:24:36.531        0
9239  0042222_D  00346389_d           0  -1  2017-04-21 15:32:16.759        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9380  0042222_D  00591788_d           0  -1  2017-04-13 23:35:29.816        0
9378  0042222_D  00591788_d           1  -1  2017-04-23 01:36:01.048        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9520  0042222_D  00136816_d           1  -1  2017-04-23 09:04:29.449        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9809  0042222_D  00564074_d           0  -1  2017-04-06 15:40:36.141        0
9808  0042222_D  00564074_d           1  -1  2017-04-23 09:31:32.117        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10171  0042222_D  00017223_d           1  -1  2017-04-25 17:32:24.352        0
10173  0042222_D  00017223_d           0  -1  2017-04-25 19:08:03.207        0

         user_id  product_id  event_type  ad               time_stamp  cluster
11272  0042222_D  00292669_d           1  -1  2017-04-25 18:17:22.639        0
11273  0042222_D  00292669_d           0  -1  2017-04-25 20:47:54.750        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9651  0042222_D  00628434_d           0  -1  2017-04-25 18:53:54.819        0
9650  0042222_D  00628434_d           1  -1  2017-04-25 19:08:55.250        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10957  0042222_D  00292135_d           1  -1  2017-04-25 19:45:47.642        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9636  0042222_D  00701561_d           1  -1  2017-04-27 10:11:37.363        0

         user_id  product_id  event_type  ad               time_stamp  cluster
10947  0042222_D  00237978_d           1  -1  2017-04-27 10:18:03.198        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9200  0042222_D  00542183_d           0  -1  2017-04-26 21:53:03.369        0
9199  0042222_D  00542183_d           1  -1  2017-04-27 14:11:45.125        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9141  0042222_D  00200638_d           0  -1  2017-04-27 16:48:09.630        0
9140  0042222_D  00200638_d           1  -1  2017-04-27 16:48:26.905        0

        user_id  product_id  event_type  ad               time_stamp  cluster
9252  0042222_D  00200353_d           0  -1  2017-04-27 14:22:58.881        0
9251  0042222_D  00200353_d           1  -1  2017-04-27 22:38:04.664        0

0043330_D
0100726_D

In [73]:
count_df_p = make_count_df_p(cluster_df)

In [74]:
count_df_p.corr()

          ca        pd  cv
ca  1.000000 -0.031361 NaN
pd -0.031361  1.000000 NaN
cv       NaN       NaN NaN

In [76]:
count_df_u = make_count_df_u(cluster_df)

In [77]:
count_df_u.corr()

          ca        pd  cv
ca  1.000000 -0.605039 NaN
pd -0.605039  1.000000 NaN
cv       NaN       NaN NaN

In [11]:
describe_cluster(0, user_df)

cluster_0

    count     mean          std     min     25%     50%      75%      max
ca    5.0  10538.2  2855.797209  7887.0  8934.0  8944.0  12165.0  14761.0
pd    5.0     19.4    23.828554     0.0     0.0     9.0     34.0     54.0
cv    5.0      0.0     0.000000     0.0     0.0     0.0      0.0      0.0

### Cluster 1
cart(mean:70)・pd(mean:15)・**cvを全員持つ(mean:9.5)**

同じ商品に関して、0=>1>=3のような流れがほとんどない。もはやいきなり購入してる。  
→おそらく似たような商品を複数ざっと見て、その中から選んでる？  
→買う前にカートに入れたりしている商品は、買った商品と似ている商品なのではないか？
* 買った商品・・・評価値上げる（ただし、推薦はしない）
* 買う前（2,3日前）に見てたけど買わなかった商品・・・評価値下げる
* 買う前にかなり見てたけど買わなかった商品・・・評価値少し上げる。  
☆買った後のカートの意味がわからない

In [81]:
cluster_df = pd.read_csv("../../data/train/D_cluster_1.csv")
action_df = get_action_df(cluster_df)
user_ids = get_user_ids(1, user_df)
user_ids[0:5]

['0006278_D', '0010267_D', '0013712_D', '0014405_D', '0014834_D']

In [82]:
action_df[action_df["user_id"]=="0105538_D"].sort_values(["time_stamp","user_id","product_id"])

        user_id  product_id  event_type  ad               time_stamp  cluster
1644  0105538_D  00155860_d           1  -1  2017-04-04 08:31:40.929        1
1634  0105538_D  00011390_d           1  -1  2017-04-04 09:05:43.364        1
1648  0105538_D  00155903_d           1  -1  2017-04-04 09:42:29.556        1
1652  0105538_D  00061060_d           1  -1  2017-04-04 13:52:16.351        1
1635  0105538_D  00772716_d           1  -1  2017-04-04 14:47:34.085        1
1656  0105538_D  00578101_d           1  -1  2017-04-05 08:55:35.561        1
1661  0105538_D  00396712_d           0  -1  2017-04-05 10:29:54.162        1
1650  0105538_D  00007227_d           1  -1  2017-04-05 12:59:00.629        1
1657  0105538_D  00604822_d           1  -1  2017-04-06 02:55:54.517        1
1636  0105538_D  00460621_d           1  -1  2017-04-06 09:13:41.007        1
1640  0105538_D  00155798_d           0  -1  2017-04-06 10:28:45.044        1
1641  0105538_D  00155798_d           3   1  2017-04-06 10:33:51.660        1
1639  0105538_D  00155739_d           1  -1  2017-04-06 11:04:14.313        1
1638  0105538_D  00264659_d           3   1  2017-04-07 05:25:31.354        1
1658  0105538_D  00460926_d           1  -1  2017-04-07 10:33:36.268        1
1660  0105538_D  00161916_d           0  -1  2017-04-07 10:33:51.821        1
1633  0105538_D  00109273_d           0  -1  2017-04-07 14:33:38.090        1
1637  0105538_D  00264659_d           1  -1  2017-04-07 14:51:44.048        1
1659  0105538_D  00161916_d           1  -1  2017-04-07 16:45:46.888        1
1651  0105538_D  00537184_d           3   1  2017-04-07 16:55:19.819        1
1653  0105538_D  00155796_d           0  -1  2017-04-07 17:12:44.044        1
1654  0105538_D  00155796_d           3   1  2017-04-07 17:12:50.952        1
1649  0105538_D  00611739_d           1  -1  2017-04-08 02:25:15.290        1

In [83]:
describe_cluster(1, user_df)

cluster_1

    count       mean         std  min  25%   50%   75%    max
ca   23.0  70.260870  106.974176  1.0  8.5  16.0  66.5  341.0
pd   23.0  15.304348   15.516662  0.0  7.5  11.0  19.0   61.0
cv   23.0   9.478261    6.960078  6.0  6.5   7.0   9.0   39.0

In [86]:
count_analysis(cluster_df)

product

          ca        pd        cv
ca  1.000000 -0.142294 -0.084942
pd -0.142294  1.000000 -0.084321
cv -0.084942 -0.084321  1.000000

user

          ca        pd        cv
ca  1.000000  0.142129 -0.072275
pd  0.142129  1.000000 -0.165134
cv -0.072275 -0.165134  1.000000

### Cluster7

In [124]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(7, user_df)
count_analysis(cluster_df)

product

          ca        pd        cv
ca  1.000000 -0.239099 -0.014707
pd -0.239099  1.000000 -0.037761
cv -0.014707 -0.037761  1.000000

user

          ca        pd        cv
ca  1.000000  0.336527  0.217254
pd  0.336527  1.000000  0.224776
cv  0.217254  0.224776  1.000000

### Cluster2
cartが多(mean:3192)・pdが少(mean:23)・cvは0

In [87]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(2, user_df)
user_ids[0:5]

['0002974_D', '0005907_D', '0009793_D', '0011704_D', '0012042_D']

In [88]:
action_df[action_df["user_id"]=="0002974_D"].sort_values(["time_stamp","user_id","product_id"])

         user_id  product_id  event_type  ad               time_stamp  cluster
30654  0002974_D  00150124_d           0  -1  2017-03-31 15:26:10.136        2
30692  0002974_D  00490642_d           0  -1  2017-03-31 15:26:10.136        2
30461  0002974_D  00068140_d           0  -1  2017-04-01 01:36:17.443        2
30696  0002974_D  00066754_d           0  -1  2017-04-01 02:45:47.634        2
30465  0002974_D  00390308_d           0  -1  2017-04-01 03:02:06.572        2
30312  0002974_D  00450321_d           0  -1  2017-04-01 03:03:24.349        2
30360  0002974_D  00788776_d           0  -1  2017-04-01 03:03:24.349        2
30614  0002974_D  00042441_d           0  -1  2017-04-01 03:03:56.796        2
30269  0002974_D  00091528_d           0  -1  2017-04-01 03:04:37.110        2
30483  0002974_D  00069358_d           0  -1  2017-04-01 03:17:01.225        2
30302  0002974_D  00066897_d           0  -1  2017-04-01 03:24:07.277        2
30458  0002974_D  00198769_d           0  -1  2017-04-01 04:06:04.147        2
30593  0002974_D  00166300_d           0  -1  2017-04-01 04:09:10.262        2
30698  0002974_D  00328072_d           0  -1  2017-04-01 04:12:35.796        2
29962  0002974_D  00741985_d           1  -1  2017-04-01 04:48:54.680        2
30327  0002974_D  00114708_d           0  -1  2017-04-01 05:24:09.313        2
30238  0002974_D  00550750_d           0  -1  2017-04-01 05:26:56.109        2
30309  0002974_D  00139484_d           0  -1  2017-04-01 05:26:58.390        2
30436  0002974_D  00479473_d           0  -1  2017-04-01 05:27:01.711        2
30485  0002974_D  00421323_d           0  -1  2017-04-01 05:27:19.048        2
30316  0002974_D  00119069_d           0  -1  2017-04-01 05:30:26.261        2
30657  0002974_D  00242754_d           0  -1  2017-04-01 05:30:30.352        2
30207  0002974_D  00001789_d           0  -1  2017-04-01 05:52:48.349        2
30234  0002974_D  00067516_d           0  -1  2017-04-01 05:52:48.349        2
30694  0002974_D  00198503_d           0  -1  2017-04-01 05:54:09.321        2
30457  0002974_D  00526002_d           0  -1  2017-04-01 08:08:40.944        2
30620  0002974_D  00271420_d           0  -1  2017-04-01 10:48:02.642        2
30697  0002974_D  00419695_d           0  -1  2017-04-01 11:01:41.003        2
30782  0002974_D  00099103_d           0  -1  2017-04-01 13:39:50.855        2
30170  0002974_D  00338725_d           1  -1  2017-04-01 13:41:47.882        2
...          ...         ...         ...  ..                      ...      ...
35711  0002974_D  00519809_d           0  -1  2017-04-28 18:14:06.262        2
35786  0002974_D  00025029_d           0  -1  2017-04-29 02:30:58.483        2
35645  0002974_D  00228913_d           0  -1  2017-04-29 02:32:41.745        2
35787  0002974_D  00439028_d           0  -1  2017-04-29 02:35:58.982        2
35812  0002974_D  00005557_d           0  -1  2017-04-29 02:46:55.182        2
35734  0002974_D  00120886_d           0  -1  2017-04-29 03:47:36.150        2
35795  0002974_D  00430361_d           0  -1  2017-04-29 04:27:34.760        2
30182  0002974_D  00786333_d           1  -1  2017-04-29 05:04:18.807        2
35644  0002974_D  00064852_d           0  -1  2017-04-29 05:10:25.052        2
35789  0002974_D  00720826_d           0  -1  2017-04-29 05:10:25.052        2
35735  0002974_D  00755578_d           0  -1  2017-04-29 07:27:27.908        2
35660  0002974_D  00133617_d           0  -1  2017-04-29 07:31:48.594        2
35691  0002974_D  00157629_d           0  -1  2017-04-29 07:33:57.746        2
35770  0002974_D  00535418_d           0  -1  2017-04-29 13:45:46.835        2
35796  0002974_D  00295046_d           0  -1  2017-04-29 14:00:32.351        2
35805  0002974_D  00365159_d           0  -1  2017-04-29 14:00:32.351        2
35790  0002974_D  00548466_d           0  -1  2017-04-29 14:07:03.187        2
35850  0002974_D  00108651_d           0  -1  2017-04-29 16:54:39.635        2
35870  0002974_D  00596124_d           0  -1  2017-04-30 02:30:19.529        2
35869  0002974_D  00189007_d           0  -1  2017-04-30 02:43:13.251        2
35868  0002974_D  00784246_d           0  -1  2017-04-30 02:50:01.240        2
35813  0002974_D  00215138_d           0  -1  2017-04-30 03:57:55.966        2
35837  0002974_D  00356983_d           0  -1  2017-04-30 04:03:36.589        2
35859  0002974_D  00212268_d           0  -1  2017-04-30 04:46:42.422        2
35865  0002974_D  00181581_d           0  -1  2017-04-30 07:56:35.205        2
35860  0002974_D  00532212_d           0  -1  2017-04-30 11:10:57.029        2
35823  0002974_D  00504969_d           0  -1  2017-04-30 12:06:50.671        2
35851  0002974_D  00494283_d           0  -1  2017-04-30 12:09:55.948        2
35867  0002974_D  00171316_d           0  -1  2017-04-30 13:52:13.076        2
35866  0002974_D  00436680_d           0  -1  2017-04-30 13:52:27.778        2

[410 rows x 6 columns]

In [58]:
describe_cluster(2, user_df)

cluster_2

    count         mean          std     min     25%     50%      75%     max
ca   28.0  3191.035714  1139.957552  1923.0  2467.5  2695.0  3629.25  5956.0
pd   28.0    23.428571    39.226246     0.0     0.0    10.0    21.75   180.0
cv   28.0     0.000000     0.000000     0.0     0.0     0.0     0.00     0.0

In [89]:
count_analysis(cluster_df)

product

          ca        pd  cv
ca  1.000000  0.015076 NaN
pd  0.015076  1.000000 NaN
cv       NaN       NaN NaN

user

          ca        pd  cv
ca  1.000000 -0.131537 NaN
pd -0.131537  1.000000 NaN
cv       NaN       NaN NaN

### Cluster9

In [110]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(9, user_df)
user_ids[0:5]

['0000368_D', '0000411_D', '0000930_D', '0001000_D', '0001241_D']

In [111]:
count_analysis(cluster_df)

product

         ca       pd  cv
ca  1.00000  0.03475 NaN
pd  0.03475  1.00000 NaN
cv      NaN      NaN NaN

user

          ca        pd  cv
ca  1.000000  0.105469 NaN
pd  0.105469  1.000000 NaN
cv       NaN       NaN NaN

### Cluster4,5,8
4 cartも少(mean:12)・pdも少(mean:9)・cvは0 /48230人  
5 cartも少(mean:25)・pdも少(mean:3)・cvは0 /34592人  
8 cart(mean:21)・pd(mean:16)・cvは0 /20225人

* カートと閲覧の回数が多いほど評価を上げる  
    - １ユーザー当たりのデータ数が少ない。
    - 購入経験がない→カート・閲覧から購入という流れがない。
    - カートから閲覧という流れもない。→良い評価値設定の方法が難しい。

In [59]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(4, user_df)
user_ids[0:10]

['0000002_D',
 '0000004_D',
 '0000012_D',
 '0000014_D',
 '0000016_D',
 '0000017_D',
 '0000018_D',
 '0000020_D',
 '0000024_D',
 '0000025_D']

In [61]:
action_df[action_df["user_id"]=="0000004_D"].sort_values(["time_stamp","user_id","product_id"])

         user_id  product_id  event_type  ad               time_stamp  cluster
45973  0000004_D  00663924_d           1  -1  2017-04-02 08:27:54.732        4
45974  0000004_D  00217794_d           1  -1  2017-04-02 08:43:37.222        4
45981  0000004_D  00439308_d           0  -1  2017-04-02 10:33:55.399        4
45975  0000004_D  00502967_d           1  -1  2017-04-09 11:53:10.215        4
45976  0000004_D  00417270_d           1  -1  2017-04-15 13:53:51.291        4
45982  0000004_D  00722819_d           0  -1  2017-04-24 20:11:54.191        4
45977  0000004_D  00709419_d           1  -1  2017-04-27 11:59:33.953        4
45983  0000004_D  00424371_d           0  -1  2017-04-27 12:06:58.237        4
45980  0000004_D  00439308_d           1  -1  2017-04-30 03:54:12.752        4
45978  0000004_D  00382341_d           1  -1  2017-04-30 03:56:39.571        4
45984  0000004_D  00169870_d           0  -1  2017-04-30 04:02:44.748        4
45979  0000004_D  00221950_d           1  -1  2017-04-30 08:12:23.432        4

In [90]:
count_analysis(cluster_df)

product

          ca        pd  cv
ca  1.000000  0.015076 NaN
pd  0.015076  1.000000 NaN
cv       NaN       NaN NaN

user

          ca        pd  cv
ca  1.000000 -0.131537 NaN
pd -0.131537  1.000000 NaN
cv       NaN       NaN NaN

### Cluster7

In [112]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(5, user_df)
count_analysis(cluster_df)

product

          ca        pd  cv
ca  1.000000  0.481091 NaN
pd  0.481091  1.000000 NaN
cv       NaN       NaN NaN

user

          ca        pd  cv
ca  1.000000 -0.128667 NaN
pd -0.128667  1.000000 NaN
cv       NaN       NaN NaN

### Cluster5

In [113]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(8, user_df)
count_analysis(cluster_df)

product

          ca        pd  cv
ca  1.000000  0.636416 NaN
pd  0.636416  1.000000 NaN
cv       NaN       NaN NaN

user

          ca        pd  cv
ca  1.000000  0.073197 NaN
pd  0.073197  1.000000 NaN
cv       NaN       NaN NaN

### Cluster6
cartが少(2,192)・pdが多(1530,1144)・cvもあったりなかったり(0,17) /2人

In [125]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(6, user_df)
user_ids

['0016920_D', '0102238_D']

In [127]:
action_df[action_df["user_id"]=="0016920_D"].sort_values(["time_stamp","user_id","product_id"])

        user_id  product_id  event_type  ad               time_stamp  cluster
2826  0016920_D  00636526_d           0  -1  2017-04-01 08:14:01.030        6
2827  0016920_D  00366789_d           0  -1  2017-04-01 08:14:55.711        6
1878  0016920_D  00761856_d           0  -1  2017-04-01 08:49:31.996        6
1879  0016920_D  00379512_d           1  -1  2017-04-01 10:08:41.451        6
2825  0016920_D  00298488_d           0  -1  2017-04-01 10:08:42.357        6
1822  0016920_D  00761856_d           1  -1  2017-04-01 11:14:13.935        6
2589  0016920_D  00059147_d           0  -1  2017-04-01 13:12:28.389        6
1880  0016920_D  00626415_d           1  -1  2017-04-01 13:44:02.841        6
1890  0016920_D  00285748_d           1  -1  2017-04-02 03:09:22.839        6
1896  0016920_D  00491613_d           1  -1  2017-04-02 03:09:43.585        6
1895  0016920_D  00418311_d           1  -1  2017-04-02 03:09:46.020        6
1891  0016920_D  00075048_d           1  -1  2017-04-02 03:09:51.997        6
1892  0016920_D  00449791_d           1  -1  2017-04-02 03:09:56.736        6
1881  0016920_D  00247232_d           1  -1  2017-04-02 13:48:11.889        6
2828  0016920_D  00599888_d           0  -1  2017-04-02 13:50:18.470        6
1894  0016920_D  00068090_d           1  -1  2017-04-02 13:51:42.961        6
1889  0016920_D  00247232_d           0  -1  2017-04-02 14:10:35.217        6
1899  0016920_D  00564124_d           0  -1  2017-04-02 14:14:07.056        6
1893  0016920_D  00740220_d           1  -1  2017-04-02 14:57:02.276        6
1908  0016920_D  00466327_d           1  -1  2017-04-02 15:33:25.394        6
1911  0016920_D  00466327_d           0  -1  2017-04-02 15:33:46.581        6
1912  0016920_D  00510549_d           1  -1  2017-04-02 16:55:46.887        6
2832  0016920_D  00732329_d           0  -1  2017-04-02 19:24:15.898        6
1897  0016920_D  00564124_d           1  -1  2017-04-03 04:21:40.045        6
2835  0016920_D  00525143_d           0  -1  2017-04-03 06:45:07.704        6
1757  0016920_D  00324405_d           0  -1  2017-04-03 08:39:49.386        6
1756  0016920_D  00065059_d           1  -1  2017-04-03 08:41:07.671        6
1918  0016920_D  00483029_d           1  -1  2017-04-04 05:16:24.036        6
1913  0016920_D  00281011_d           1  -1  2017-04-04 05:16:50.489        6
2836  0016920_D  00067654_d           0  -1  2017-04-04 06:34:50.360        6
...         ...         ...         ...  ..                      ...      ...
2646  0016920_D  00386268_d           1  -1  2017-04-25 17:48:07.022        6
2659  0016920_D  00114030_d           1  -1  2017-04-25 17:59:27.693        6
2794  0016920_D  00440730_d           1  -1  2017-04-25 17:59:31.293        6
1599  0016920_D  00612896_d           1  -1  2017-04-25 18:09:05.380        6
2716  0016920_D  00300539_d           1  -1  2017-04-25 18:14:09.371        6
2723  0016920_D  00171174_d           1  -1  2017-04-25 18:41:01.313        6
2612  0016920_D  00477174_d           1  -1  2017-04-25 20:03:00.589        6
2877  0016920_D  00304859_d           0  -1  2017-04-27 02:09:10.459        6
1664  0016920_D  00363438_d           1  -1  2017-04-27 12:12:54.264        6
1820  0016920_D  00237425_d           1  -1  2017-04-27 13:01:54.423        6
1814  0016920_D  00537669_d           0  -1  2017-04-27 15:01:37.295        6
2809  0016920_D  00006342_d           1  -1  2017-04-27 15:03:10.117        6
2821  0016920_D  00339368_d           1  -1  2017-04-27 15:04:26.995        6
1610  0016920_D  00392555_d           1  -1  2017-04-27 15:12:26.399        6
2818  0016920_D  00006342_d           0  -1  2017-04-27 15:54:57.794        6
2819  0016920_D  00709580_d           1  -1  2017-04-27 15:58:40.002        6
1532  0016920_D  00654536_d           1  -1  2017-04-27 16:44:21.356        6
1624  0016920_D  00622130_d           1  -1  2017-04-27 17:02:07.842        6
1797  0016920_D  00537669_d           1  -1  2017-04-27 17:16:17.954        6
2823  0016920_D  00051696_d           1  -1  2017-04-27 17:49:09.847        6
1715  0016920_D  00363438_d           0  -1  2017-04-27 18:41:23.954        6
2822  0016920_D  00135170_d           1  -1  2017-04-28 03:25:53.303        6
2883  0016920_D  00040588_d           0  -1  2017-04-28 03:28:03.724        6
2882  0016920_D  00652856_d           0  -1  2017-04-28 03:58:13.821        6
1663  0016920_D  00622130_d           0  -1  2017-04-28 09:24:51.954        6
2878  0016920_D  00159425_d           0  -1  2017-04-28 09:44:42.885        6
1620  0016920_D  00165027_d           1  -1  2017-04-28 14:23:03.639        6
1621  0016920_D  00208550_d           0  -1  2017-04-28 14:46:31.569        6
2884  0016920_D  00722197_d           0  -1  2017-04-29 12:39:00.920        6
2824  0016920_D  00150555_d           1  -1  2017-04-30 11:40:22.805        6

[242 rows x 6 columns]

### Cluster7
cart(mean:23)・pd(mean:13)・cvを全員持つ(mean:1.5)

In [97]:
describe_cluster(7,user_df)

cluster_7

    count       mean        std  min  25%   50%    75%    max
ca  358.0  26.139665  67.134486  0.0  5.0  12.0  22.75  968.0
pd  358.0  13.952514  12.694668  0.0  7.0  10.0  17.00  107.0
cv  358.0   1.522346   0.858833  1.0  1.0   1.0   2.00    5.0

cvもちょくちょくある

In [94]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(7, user_df)
user_ids[0:5]

['0000410_D', '0001211_D', '0001457_D', '0001789_D', '0002804_D']

In [102]:
action_df[action_df["user_id"]=="0001457_D"].sort_values(["time_stamp","user_id","product_id"])

        user_id  product_id  event_type  ad               time_stamp  cluster
4696  0001457_D  00176092_d           1  -1  2017-04-01 08:01:21.531        7
4693  0001457_D  00509211_d           0  -1  2017-04-01 14:13:55.849        7
4697  0001457_D  00493161_d           1  -1  2017-04-01 14:23:53.354        7
4698  0001457_D  00427752_d           1  -1  2017-04-01 14:46:23.492        7
4718  0001457_D  00785736_d           0  -1  2017-04-01 15:00:59.999        7
4725  0001457_D  00032217_d           0  -1  2017-04-01 15:04:23.135        7
4723  0001457_D  00087289_d           0  -1  2017-04-01 15:04:51.157        7
4724  0001457_D  00103099_d           0  -1  2017-04-01 15:07:40.106        7
4699  0001457_D  00249301_d           1  -1  2017-04-01 15:12:18.653        7
4701  0001457_D  00166322_d           1  -1  2017-04-01 15:15:08.481        7
4719  0001457_D  00122246_d           0  -1  2017-04-01 15:16:07.574        7
4700  0001457_D  00748380_d           1  -1  2017-04-01 15:16:12.657        7
4717  0001457_D  00228711_d           0  -1  2017-04-01 19:04:09.583        7
4722  0001457_D  00305746_d           0  -1  2017-04-01 19:04:09.583        7
4702  0001457_D  00060687_d           1  -1  2017-04-01 19:24:00.122        7
4704  0001457_D  00743622_d           1  -1  2017-04-04 12:58:31.268        7
4703  0001457_D  00212646_d           1  -1  2017-04-04 13:59:16.356        7
4705  0001457_D  00458018_d           1  -1  2017-04-07 04:53:06.332        7
4692  0001457_D  00747473_d           1  -1  2017-04-07 16:40:23.896        7
4727  0001457_D  00570150_d           0  -1  2017-04-07 17:09:41.043        7
4706  0001457_D  00325975_d           1  -1  2017-04-09 01:27:00.031        7
4707  0001457_D  00286785_d           1  -1  2017-04-11 14:17:37.495        7
4694  0001457_D  00540694_d           3   1  2017-04-12 05:13:26.761        7
4728  0001457_D  00587216_d           0  -1  2017-04-12 18:37:33.992        7
4729  0001457_D  00737833_d           0  -1  2017-04-12 18:42:07.446        7
4708  0001457_D  00326472_d           1  -1  2017-04-12 18:45:47.808        7
4730  0001457_D  00219628_d           0  -1  2017-04-14 14:35:26.885        7
4710  0001457_D  00333068_d           1  -1  2017-04-18 22:16:57.106        7
4709  0001457_D  00682906_d           1  -1  2017-04-19 14:12:29.650        7
4712  0001457_D  00675509_d           1  -1  2017-04-19 14:22:20.051        7
4711  0001457_D  00577692_d           1  -1  2017-04-19 14:22:52.295        7
4695  0001457_D  00060396_d           1  -1  2017-04-19 14:25:34.622        7
4731  0001457_D  00285517_d           0  -1  2017-04-19 18:35:03.464        7
4732  0001457_D  00094015_d           0  -1  2017-04-20 12:13:33.740        7
4713  0001457_D  00014053_d           1  -1  2017-04-21 18:00:38.338        7
4714  0001457_D  00012474_d           1  -1  2017-04-24 21:59:05.508        7
4715  0001457_D  00012474_d           3   1  2017-04-24 22:00:50.244        7
4733  0001457_D  00032080_d           3   1  2017-04-24 22:12:03.810        7
4716  0001457_D  00495195_d           1  -1  2017-04-28 12:40:06.238        7

In [103]:
cluster_df[cluster_df["user_id"]=="0001457_D"].sort_values("time_stamp")

        user_id  product_id  event_type  ad               time_stamp  cluster
4696  0001457_D  00176092_d           1  -1  2017-04-01 08:01:21.531        7
4693  0001457_D  00509211_d           0  -1  2017-04-01 14:13:55.849        7
4697  0001457_D  00493161_d           1  -1  2017-04-01 14:23:53.354        7
4698  0001457_D  00427752_d           1  -1  2017-04-01 14:46:23.492        7
4718  0001457_D  00785736_d           0  -1  2017-04-01 15:00:59.999        7
4725  0001457_D  00032217_d           0  -1  2017-04-01 15:04:23.135        7
4723  0001457_D  00087289_d           0  -1  2017-04-01 15:04:51.157        7
4724  0001457_D  00103099_d           0  -1  2017-04-01 15:07:40.106        7
4699  0001457_D  00249301_d           1  -1  2017-04-01 15:12:18.653        7
4726  0001457_D  00032217_d           0  -1  2017-04-01 15:14:13.707        7
4701  0001457_D  00166322_d           1  -1  2017-04-01 15:15:08.481        7
4719  0001457_D  00122246_d           0  -1  2017-04-01 15:16:07.574        7
4700  0001457_D  00748380_d           1  -1  2017-04-01 15:16:12.657        7
4722  0001457_D  00305746_d           0  -1  2017-04-01 19:04:09.583        7
4717  0001457_D  00228711_d           0  -1  2017-04-01 19:04:09.583        7
4721  0001457_D  00122246_d           0  -1  2017-04-01 19:04:09.583        7
4702  0001457_D  00060687_d           1  -1  2017-04-01 19:24:00.122        7
4720  0001457_D  00122246_d           0  -1  2017-04-01 19:45:56.922        7
4704  0001457_D  00743622_d           1  -1  2017-04-04 12:58:31.268        7
4703  0001457_D  00212646_d           1  -1  2017-04-04 13:59:16.356        7
4705  0001457_D  00458018_d           1  -1  2017-04-07 04:53:06.332        7
4692  0001457_D  00747473_d           1  -1  2017-04-07 16:40:23.896        7
4727  0001457_D  00570150_d           0  -1  2017-04-07 17:09:41.043        7
4706  0001457_D  00325975_d           1  -1  2017-04-09 01:27:00.031        7
4707  0001457_D  00286785_d           1  -1  2017-04-11 14:17:37.495        7
4694  0001457_D  00540694_d           3   1  2017-04-12 05:13:26.761        7
4728  0001457_D  00587216_d           0  -1  2017-04-12 18:37:33.992        7
4729  0001457_D  00737833_d           0  -1  2017-04-12 18:42:07.446        7
4708  0001457_D  00326472_d           1  -1  2017-04-12 18:45:47.808        7
4730  0001457_D  00219628_d           0  -1  2017-04-14 14:35:26.885        7
4710  0001457_D  00333068_d           1  -1  2017-04-18 22:16:57.106        7
4709  0001457_D  00682906_d           1  -1  2017-04-19 14:12:29.650        7
4712  0001457_D  00675509_d           1  -1  2017-04-19 14:22:20.051        7
4711  0001457_D  00577692_d           1  -1  2017-04-19 14:22:52.295        7
4695  0001457_D  00060396_d           1  -1  2017-04-19 14:25:34.622        7
4731  0001457_D  00285517_d           0  -1  2017-04-19 18:35:03.464        7
4732  0001457_D  00094015_d           0  -1  2017-04-20 12:13:33.740        7
4713  0001457_D  00014053_d           1  -1  2017-04-21 18:00:38.338        7
4714  0001457_D  00012474_d           1  -1  2017-04-24 21:59:05.508        7
4715  0001457_D  00012474_d           3   1  2017-04-24 22:00:50.244        7
4733  0001457_D  00032080_d           3   1  2017-04-24 22:12:03.810        7
4716  0001457_D  00495195_d           1  -1  2017-04-28 12:40:06.238        7

### Cluster3,10
3
cart(mean:132)・pd(mean:77)・cvは0(一人1)・閲覧を全員50以上する /407

10
cart(mean:50)・pd(mean:33)・cvは0・閲覧を全員20以上する /4431

In [116]:
describe_cluster(3, user_df)

cluster_3

    count        mean         std   min   25%   50%    75%     max
ca  407.0  132.950860  146.277917   0.0  33.5  86.0  188.0  1362.0
pd  407.0   77.248157   30.675159  51.0  60.5  66.0   81.0   300.0
cv  407.0    0.002457    0.049568   0.0   0.0   0.0    0.0     1.0

In [117]:
describe_cluster(10, user_df)

cluster_10

     count       mean        std   min   25%   50%   75%    max
ca  4431.0  50.783119  54.278266   0.0  14.0  36.0  68.0  383.0
pd  4431.0  33.225683   7.239101  21.0  28.0  31.0  37.0   56.0
cv  4431.0   0.000000   0.000000   0.0   0.0   0.0   0.0    0.0

In [120]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(3, user_df)
user_ids[0:5]

['0000098_D', '0000389_D', '0000536_D', '0000756_D', '0001844_D']

In [122]:
cluster_df[cluster_df["user_id"]=="0000389_D"]

         user_id  product_id  event_type  ad               time_stamp  cluster
67841  0000389_D  00330529_d           0  -1  2017-04-14 07:59:56.503        3
67842  0000389_D  00155966_d           1  -1  2017-04-01 13:06:59.020        3
67843  0000389_D  00788269_d           1  -1  2017-04-02 13:10:15.985        3
67844  0000389_D  00143311_d           1  -1  2017-04-02 13:53:24.635        3
67845  0000389_D  00040867_d           1  -1  2017-04-02 13:42:46.047        3
67846  0000389_D  00616873_d           1  -1  2017-04-02 13:47:59.206        3
67847  0000389_D  00656083_d           1  -1  2017-04-02 15:45:54.224        3
67848  0000389_D  00351008_d           1  -1  2017-04-03 13:30:19.361        3
67849  0000389_D  00087694_d           1  -1  2017-04-04 04:55:12.057        3
67850  0000389_D  00017064_d           1  -1  2017-04-04 08:29:44.911        3
67851  0000389_D  00612861_d           1  -1  2017-04-06 05:26:19.825        3
67852  0000389_D  00421923_d           1  -1  2017-04-07 12:56:50.863        3
67853  0000389_D  00355263_d           1  -1  2017-04-08 06:44:01.002        3
67854  0000389_D  00232056_d           1  -1  2017-04-08 06:47:13.387        3
67855  0000389_D  00031527_d           1  -1  2017-04-08 14:20:14.354        3
67856  0000389_D  00560661_d           1  -1  2017-04-10 08:14:30.286        3
67857  0000389_D  00560661_d           1  -1  2017-04-15 06:44:15.228        3
67858  0000389_D  00560661_d           1  -1  2017-04-15 06:02:04.525        3
67859  0000389_D  00665556_d           1  -1  2017-04-10 11:27:37.117        3
67860  0000389_D  00361519_d           1  -1  2017-04-11 12:13:19.014        3
67861  0000389_D  00661105_d           1  -1  2017-04-12 03:49:39.394        3
67862  0000389_D  00661105_d           1  -1  2017-04-15 06:02:23.981        3
67863  0000389_D  00301227_d           1  -1  2017-04-13 19:09:11.290        3
67864  0000389_D  00393794_d           1  -1  2017-04-15 06:34:39.556        3
67865  0000389_D  00247118_d           1  -1  2017-04-15 06:29:00.318        3
67866  0000389_D  00247118_d           1  -1  2017-04-15 06:30:34.915        3
67867  0000389_D  00337921_d           1  -1  2017-04-16 01:42:49.520        3
67868  0000389_D  00311625_d           1  -1  2017-04-17 08:47:55.291        3
67869  0000389_D  00311625_d           1  -1  2017-04-27 09:57:54.546        3
67870  0000389_D  00212200_d           1  -1  2017-04-17 08:41:15.560        3
...          ...         ...         ...  ..                      ...      ...
67999  0000389_D  00559640_d           0  -1  2017-04-26 05:57:30.820        3
68000  0000389_D  00536918_d           0  -1  2017-04-26 05:48:40.633        3
68001  0000389_D  00710887_d           0  -1  2017-04-26 05:56:56.608        3
68002  0000389_D  00356438_d           0  -1  2017-04-26 05:46:38.052        3
68003  0000389_D  00155970_d           0  -1  2017-04-26 14:21:40.587        3
68004  0000389_D  00710886_d           0  -1  2017-04-26 07:47:21.932        3
68005  0000389_D  00401955_d           0  -1  2017-04-26 05:49:33.099        3
68006  0000389_D  00705003_d           0  -1  2017-04-27 09:54:23.014        3
68007  0000389_D  00341066_d           0  -1  2017-04-27 12:32:42.557        3
68008  0000389_D  00341066_d           0  -1  2017-04-27 15:28:37.325        3
68009  0000389_D  00256648_d           0  -1  2017-04-27 12:46:33.629        3
68010  0000389_D  00541326_d           0  -1  2017-04-27 12:44:58.204        3
68011  0000389_D  00541326_d           0  -1  2017-04-27 09:51:49.086        3
68012  0000389_D  00704837_d           0  -1  2017-04-27 09:55:52.380        3
68013  0000389_D  00405893_d           0  -1  2017-04-27 09:59:02.244        3
68014  0000389_D  00377013_d           0  -1  2017-04-28 07:08:10.064        3
68015  0000389_D  00600471_d           0  -1  2017-04-27 15:32:00.632        3
68016  0000389_D  00767297_d           0  -1  2017-04-28 10:12:25.920        3
68017  0000389_D  00167157_d           0  -1  2017-04-28 13:32:09.413        3
68018  0000389_D  00167157_d           0  -1  2017-04-28 10:12:38.601        3
68019  0000389_D  00167157_d           0  -1  2017-04-29 00:16:07.959        3
68020  0000389_D  00701927_d           0  -1  2017-04-28 10:15:16.432        3
68021  0000389_D  00706204_d           0  -1  2017-04-28 07:22:32.785        3
68022  0000389_D  00724325_d           0  -1  2017-04-29 12:25:54.854        3
68023  0000389_D  00156259_d           0  -1  2017-04-29 12:20:42.821        3
68024  0000389_D  00543208_d           0  -1  2017-04-30 10:50:01.308        3
68025  0000389_D  00374874_d           0  -1  2017-04-30 11:24:19.267        3
68026  0000389_D  00642521_d           0  -1  2017-04-30 10:44:15.041        3
68027  0000389_D  00439040_d           0  -1  2017-04-30 11:27:03.279        3
68028  0000389_D  00543146_d           0  -1  2017-04-30 04:28:59.115        3

[188 rows x 6 columns]

In [115]:
action_df[action_df["user_id"]=="0000098_D"].sort_values(["time_stamp","user_id","product_id"])

         user_id  product_id  event_type  ad               time_stamp  cluster
38901  0000098_D  00135739_d           0  -1  2017-04-01 10:35:04.772        3
38766  0000098_D  00586927_d           0  -1  2017-04-01 10:35:04.772        3
38771  0000098_D  00623191_d           0  -1  2017-04-01 12:47:37.710        3
38792  0000098_D  00307771_d           1  -1  2017-04-02 13:49:32.392        3
38904  0000098_D  00648799_d           0  -1  2017-04-02 14:06:51.908        3
38909  0000098_D  00564453_d           0  -1  2017-04-03 12:16:59.101        3
38907  0000098_D  00247278_d           0  -1  2017-04-03 12:17:28.236        3
38795  0000098_D  00785693_d           1  -1  2017-04-03 12:18:10.856        3
38911  0000098_D  00721921_d           0  -1  2017-04-03 12:20:02.979        3
38794  0000098_D  00029673_d           0  -1  2017-04-03 12:47:03.779        3
38793  0000098_D  00029673_d           1  -1  2017-04-03 13:02:57.871        3
38906  0000098_D  00647419_d           0  -1  2017-04-03 13:11:30.020        3
38796  0000098_D  00736898_d           1  -1  2017-04-04 12:57:45.259        3
38797  0000098_D  00129577_d           1  -1  2017-04-04 13:40:36.858        3
38803  0000098_D  00657574_d           0  -1  2017-04-04 13:44:22.426        3
38912  0000098_D  00614272_d           0  -1  2017-04-05 13:00:17.115        3
38801  0000098_D  00346425_d           1  -1  2017-04-06 09:01:18.791        3
38914  0000098_D  00363238_d           0  -1  2017-04-06 09:08:23.197        3
38775  0000098_D  00441460_d           0  -1  2017-04-06 09:08:23.197        3
38913  0000098_D  00096013_d           0  -1  2017-04-06 09:10:54.682        3
38746  0000098_D  00099697_d           0  -1  2017-04-06 09:18:37.703        3
38800  0000098_D  00488667_d           1  -1  2017-04-06 12:23:36.476        3
38802  0000098_D  00657574_d           1  -1  2017-04-07 12:46:08.121        3
38810  0000098_D  00228971_d           1  -1  2017-04-07 12:46:24.747        3
38809  0000098_D  00092031_d           1  -1  2017-04-07 12:49:16.971        3
38916  0000098_D  00138823_d           0  -1  2017-04-07 13:14:23.261        3
38812  0000098_D  00470233_d           1  -1  2017-04-08 13:02:15.984        3
38747  0000098_D  00772548_d           0  -1  2017-04-08 13:11:07.095        3
38814  0000098_D  00700922_d           1  -1  2017-04-08 13:11:23.404        3
38917  0000098_D  00502744_d           0  -1  2017-04-08 13:24:53.415        3
...          ...         ...         ...  ..                      ...      ...
39145  0000098_D  00382170_d           0  -1  2017-04-26 04:18:49.779        3
39123  0000098_D  00091000_d           0  -1  2017-04-26 04:22:21.702        3
39135  0000098_D  00091431_d           0  -1  2017-04-26 04:22:21.702        3
38883  0000098_D  00324955_d           1  -1  2017-04-26 04:38:20.628        3
38888  0000098_D  00333439_d           1  -1  2017-04-26 04:47:22.815        3
39136  0000098_D  00164178_d           0  -1  2017-04-26 05:19:10.694        3
38878  0000098_D  00317809_d           1  -1  2017-04-26 05:52:15.533        3
39132  0000098_D  00461871_d           0  -1  2017-04-26 06:49:21.365        3
38879  0000098_D  00044991_d           1  -1  2017-04-26 06:56:10.593        3
38886  0000098_D  00691317_d           1  -1  2017-04-26 07:00:30.276        3
39128  0000098_D  00187307_d           0  -1  2017-04-26 07:01:31.337        3
39130  0000098_D  00017532_d           0  -1  2017-04-26 07:15:43.133        3
39138  0000098_D  00344703_d           0  -1  2017-04-26 07:21:04.516        3
38887  0000098_D  00690955_d           1  -1  2017-04-26 11:31:19.301        3
39121  0000098_D  00581550_d           0  -1  2017-04-26 12:26:12.442        3
38742  0000098_D  00157916_d           0  -1  2017-04-29 06:07:26.565        3
38890  0000098_D  00463287_d           1  -1  2017-04-29 06:07:29.060        3
38899  0000098_D  00012214_d           1  -1  2017-04-29 06:53:54.843        3
39156  0000098_D  00537434_d           0  -1  2017-04-29 07:09:24.354        3
39151  0000098_D  00709451_d           0  -1  2017-04-29 07:18:33.827        3
38889  0000098_D  00091162_d           1  -1  2017-04-29 13:15:15.551        3
39155  0000098_D  00479892_d           0  -1  2017-04-29 13:16:22.251        3
38900  0000098_D  00455384_d           1  -1  2017-04-29 13:23:48.590        3
39147  0000098_D  00365378_d           0  -1  2017-04-29 13:32:34.453        3
39157  0000098_D  00382502_d           0  -1  2017-04-29 13:33:48.021        3
38748  0000098_D  00122161_d           0  -1  2017-04-29 13:40:13.763        3
38891  0000098_D  00463287_d           0  -1  2017-04-29 13:42:47.214        3
39158  0000098_D  00476168_d           0  -1  2017-04-29 15:09:03.775        3
38744  0000098_D  00734044_d           0  -1  2017-04-29 22:09:31.452        3
39160  0000098_D  00582339_d           0  -1  2017-04-30 13:20:17.518        3

[176 rows x 6 columns]

In [118]:
count_analysis(cluster_df)

product

          ca        pd       cv
ca  1.000000  0.022126 -0.00242
pd  0.022126  1.000000  0.00052
cv -0.002420  0.000520  1.00000

user

          ca        pd        cv
ca  1.000000  0.177555  0.048254
pd  0.177555  1.000000 -0.011741
cv  0.048254 -0.011741  1.000000

In [119]:
cluster_df, action_df, user_ids = prepare_cluster_analysis(10, user_df)
count_analysis(cluster_df)

product

          ca        pd  cv
ca  1.000000  0.402851 NaN
pd  0.402851  1.000000 NaN
cv       NaN       NaN NaN

user

          ca        pd  cv
ca  1.000000  0.090575 NaN
pd  0.090575  1.000000 NaN
cv       NaN       NaN NaN